In [7]:
import numpy as np
import pandas as pd

1. Create a program that asks the user to enter their name and their age. Print out a message that tells them the year that they will turn 100 years old

In [5]:
name = input("Enter your name ")
age = int(input("Enter your age "))
print('Name : ',name)
print('Age : ', age)

Enter your name Sri
Enter your age 30
Name :  Sri
Age :  30

 2. What is pandas groupby? Demonstrate with your own example

###### Pandas group by will allow us for aggrations with respect to particular column catgory of values

In [22]:
df = pd.DataFrame([[1,'Maths',20,90,40],[1,'physics',10,20,40],[2,'Maths',25,43,50],[2,'physics',20,10,60]],columns=['year','sub','sem1','sem2','sem3'])
df

   year      sub  sem1  sem2  sem3
0     1    Maths    20    90    40
1     1  physics    10    20    40
2     2    Maths    25    43    50
3     2  physics    20    10    60

In [26]:
df.groupby(['sub'])['sem1','sem2','sem3'].max()

/tmp/ipykernel_35159/2581510420.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(['sub'])['sem1','sem2','sem3'].max()

         sem1  sem2  sem3
sub
Maths      25    90    50
physics    20    20    60

3. How to create a dataframe from list?

In [33]:
d1 = pd.Series([1,'hi','a'])
d1

0     1
1    hi
2     a
dtype: object

In [37]:
d2 = pd.DataFrame([[1,2,3],[4,5,6]],columns=['v1','v2','v3'])
d2

   v1  v2  v3
0   1   2   3
1   4   5   6

4. What are the ways to combine the dataframe in pandas. Give an example for each

In [75]:
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
                    'Name': ['ABC', 'PQR', 'DEF', 'GHI']})
  
df2 = pd.DataFrame({'City': ['MUMBAI', 'PUNE', 'MUMBAI', 'DELHI'],
                    'Age': ['12', '13', '14', '12']})

In [78]:
#using Concat
pd.concat([df1,df2],axis=1)

    id Name    City Age
0  A01  ABC  MUMBAI  12
1  A02  PQR    PUNE  13
2  A03  DEF  MUMBAI  14
3  A04  GHI   DELHI  12

In [82]:
#using append
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
                    'Name': ['ABC', 'PQR', 'DEF', 'GHI']})
  
# Second DataFrame
df2 = pd.DataFrame({'id': ['B05', 'B06', 'B07', 'B08'],
                    'Name': ['XYZ', 'TUV', 'MNO', 'JKL']})
df1.append(df2)

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
0  B05  XYZ
1  B06  TUV
2  B07  MNO
3  B08  JKL

5. What is the difference between list and tuples in Python?

* List is mutable where as tuple is immutable.
* List is more flexible compare to tuple
* List as many functions than tuple
* Tuple is more memory efficient than list

6. Find out the mean, median and standard deviation of this numpy array -> np.array([1,5,3,100,4,48])

In [40]:
a = np.array([1,5,3,100,4,48])

In [47]:
np.mean(a)

26.833333333333332

In [46]:
np.std(a)

36.59424666377065

In [45]:
np.median(a)

4.5

7. How will you remove duplicate elements from a list?

In [49]:
a =  [2,3,2]
a

[2, 3, 2]

In [51]:
a = list(set(a))
a

[2, 3]

8. What is a map() function in Python? Give an example

Map function is to generate new value from the existing value based on the given function logic. THis will be usedful to convert from one standard to other standard. Let's say cm to inches.

In [63]:
a = map(lambda x : x*x,[2,3,4])
list(a)

[4, 9, 16]

9. What is pass in Python?

Pass will hep in the conditional statement to pass on with out giving any logic. let's say we may not have some logic for if case that time it will help as fillter to escape from syntactical issues.

In [65]:
if 'A' != 'A':
    pass
else:
    print('This is how it is used')

This is how it is used

10. What is vstack() in numpy? Give an example

In [66]:
a = np.array([1, 2, 3])
b = np.array([4, 5, 6])

vstack helps to compbine two arrays as added rows one to another easier manner

In [70]:
np.vstack([a,b])

array([[1, 2, 3],
       [4, 5, 6]])

#### Thanks for Reviewing